content/emacs/modes/projectile-mode.org
# -*- coding:utf-8-*-
#+TITLE:projectile
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

详见 [[https://projectile.readthedocs.io/en/latest/][Projectile Manual]]

* 概述
  [[https://github.com/bbatsov/projectile][Projectile]] 是 Emacs 的项目交互库。它的目标是在项目级别上提供一系列优秀的功能，而不会引入外部依赖。例如，有一个用纯 Emacs Lisp 编写的查找项目文件功能，而不使用 GNU find（但出于性能考虑，也存在由外部命令支持的索引机制）。

  Projectile 以实用为目的：虽然考虑便携性，但是如果一些可用的外部工具可以大大加快某些任务，那么 Projectile 将利用它们。

  该库提供简单的项目管理和导航。项目的概念非常简单：只是一个包含特殊文件的文件夹。目前包含 git，mercurial，darcs 和 bazaar repo的文件夹被视为项目。lein，maven，sbt，scons，rebar 和 bundler 项目也是如此。如果要将文件夹手动标记为项目，只需在其中创建一个空的 =.projectile= 文件。Projectile 的一些特点：
  + 跳转到项目中的文件(c-p-f)。
  + 跳转到项目中当前 point 处所指示的文件(c-p-g)。
  + 跳转到项目中的目录(c-p-d)。
  + 跳转到目录中的文件。
  + 跳转到项目有关的 buffer(c-p-b)。
  + 跳转到项目的测试(c-p-T)。
  + 在同名但不同扩展名的文件间跳转（例如.h 和.cpp）(c-p-a)。
  + 跳转到项目中最近浏览的文件(c-p-e)。
  + 在工作的项目间切换。
  + 关闭项目有关的 buffer(c-p-k)。
  + 在项目范围内替换(c-p-r)。
  + 在项目所有 buffer 中查找出现(c-p-o)。
  + 在项目中查找(c-p-s-g)。
  + 重新生成你项目的 etags 或 gtags。
  + 在 dired 中访问项目(c-p-D)。
  + 在项目上执行 make。
  + 在项目的根目录执行命令(c-p-!)。
  + 检查脏的存储库。
  + 创建项目设置文件(dir-local-file)(c-p-E)

* 安装

** Prerequisites

** Installation via package.el

** Installation via use-package
   如果要安装在主分支中找到的 Projectile 版本，请在 Emacs 初始化文件（.emacs 或 init.el）中声明以下内容：
   #+BEGIN_SRC elisp
(use-package projectile
  :ensure t
  :config
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (projectile-mode +1))
   #+END_SRC
   但是，如果您想要更加保守并且只使用 Projectile 的稳定版本，需要声明以下内容：
   #+BEGIN_SRC elisp
(use-package projectile
  :ensure t
  :pin melpa-stable
  :config
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (projectile-mode +1))
   #+END_SRC

** Installation via el-get

** Installation on Debian and Ubuntu

** Emacs Prelude
   Projectile 与 Emacs Prelude 捆绑在一起。如果是 Prelude 用户，Projectile 已经正确配置。

* Usage

** Basic Usage

** Interactive Commands

* Projects

** Supported Project Types
   Projectile 的主要目标之一是在不需要任何配置的情况下操作各种项目类型。为实现这一点，它包含许多项目检测逻辑和项目类型特定的逻辑。

** Version Control Systems
    Projectile 可讲大多数版本控制的仓库识别为一个项目。Projectile 支持：
    + Git
    + Mercurial
    + Bazaar
    + Subversion
    + CVS
    + Fossil
    + Darcs

