emacs/modes/projectile-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-05 四 17:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>projectile</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">projectile</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org940b1e4">1. 概述</a></li>
<li><a href="#org8c90803">2. 安装</a>
<ul>
<li><a href="#org4072c4e">2.1. Prerequisites</a></li>
<li><a href="#org5c7ec2b">2.2. Installation via package.el</a></li>
<li><a href="#orgd7c12f6">2.3. Installation via use-package</a></li>
<li><a href="#org0a0882d">2.4. Installation via el-get</a></li>
<li><a href="#org0922466">2.5. Installation on Debian and Ubuntu</a></li>
<li><a href="#orgf2e54e5">2.6. Emacs Prelude</a></li>
</ul>
</li>
<li><a href="#org7c1acd2">3. Usage</a>
<ul>
<li><a href="#orga6ab45f">3.1. Basic Usage</a></li>
<li><a href="#org1894a3e">3.2. Interactive Commands</a></li>
</ul>
</li>
<li><a href="#org9492ddf">4. Projects</a>
<ul>
<li><a href="#org363d59b">4.1. Supported Project Types</a></li>
<li><a href="#orgceddc3e">4.2. Version Control Systems</a></li>
<li><a href="#org0db06a7">4.3. File markers</a></li>
<li><a href="#org85f0f5d">4.4. Adding Custom Project Types</a></li>
<li><a href="#org63ce0ac">4.5. Returning Projectile Commands from a function</a></li>
<li><a href="#orgdf6f60e">4.6. Customizing project root files</a></li>
<li><a href="#org0c8616b">4.7. Ignoring files</a></li>
<li><a href="#org8a57771">4.8. File-local project root definitions</a></li>
<li><a href="#orge0742c4">4.9. Storing project settings</a>
<ul>
<li><a href="#org892a399">4.9.1. Configuring Projectile's Behavior</a></li>
<li><a href="#org1e52b37">4.9.2. Configure a Project's Compilation, Test and Run commands</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9d6733c">5. Configuration</a>
<ul>
<li><a href="#org28c5b59">5.1. Project indexing method</a></li>
<li><a href="#org7f37073">5.2. Alien indexing</a></li>
<li><a href="#orgfeb83f6">5.3. Caching</a>
<ul>
<li><a href="#orgcbc27b1">5.3.1. Project files</a></li>
<li><a href="#org907932b">5.3.2. File exists cache</a></li>
</ul>
</li>
<li><a href="#org67c1a6e">5.4. Using Projectile everywhere</a></li>
<li><a href="#org7ea6c10">5.5. Switching projects</a>
<ul>
<li><a href="#org46471a8">5.5.1. projectile-find-file</a></li>
<li><a href="#orgfc99241">5.5.2. projectile-find-file-in-known-projects</a></li>
<li><a href="#org72ee950">5.5.3. projectile-find-file-dwim</a></li>
<li><a href="#org4162725">5.5.4. projectile-dired</a></li>
<li><a href="#orgde43fdf">5.5.5. projectile-find-dir</a></li>
</ul>
</li>
<li><a href="#org0268351">5.6. Completion Options</a>
<ul>
<li><a href="#orgd2b4eeb">5.6.1. Ido</a></li>
<li><a href="#orgf2b337b">5.6.2. Ivy (recommended)</a></li>
<li><a href="#org3963fd8">5.6.3. Basic (Emacs's default)</a></li>
<li><a href="#org869d776">5.6.4. Custom Completion Function</a></li>
<li><a href="#org4b38cdd">5.6.5. Regenerate tags</a></li>
</ul>
</li>
<li><a href="#org0448c82">5.7. Idle Timer</a></li>
<li><a href="#org42f9375">5.8. Mode line indicator</a></li>
</ul>
</li>
<li><a href="#orge208ec5">6. Extensions</a></li>
</ul>
</div>
</div>
<p>
详见 <a href="https://projectile.readthedocs.io/en/latest/">Projectile Manual</a>
</p>

<div id="outline-container-org940b1e4" class="outline-2">
<h2 id="org940b1e4"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/bbatsov/projectile">Projectile</a> 是 Emacs 的项目交互库。它的目标是在项目级别上提供一系列优秀的功能，而不会引入外部依赖。例如，有一个用纯 Emacs Lisp 编写的查找项目文件功能，而不使用 GNU find（但出于性能考虑，也存在由外部命令支持的索引机制）。
</p>

<p>
Projectile 以实用为目的：虽然考虑便携性，但是如果一些可用的外部工具可以大大加快某些任务，那么 Projectile 将利用它们。
</p>

<p>
该库提供简单的项目管理和导航。项目的概念非常简单：只是一个包含特殊文件的文件夹。目前包含 git，mercurial，darcs 和 bazaar repo的文件夹被视为项目。lein，maven，sbt，scons，rebar 和 bundler 项目也是如此。如果要将文件夹手动标记为项目，只需在其中创建一个空的 <code>.projectile</code> 文件。Projectile 的一些特点：
</p>
<ul class="org-ul">
<li>跳转到项目中的文件(c-p-f)。</li>
<li>跳转到项目中当前 point 处所指示的文件(c-p-g)。</li>
<li>跳转到项目中的目录(c-p-d)。</li>
<li>跳转到目录中的文件。</li>
<li>跳转到项目有关的 buffer(c-p-b)。</li>
<li>跳转到项目的测试(c-p-T)。</li>
<li>在同名但不同扩展名的文件间跳转（例如.h 和.cpp）(c-p-a)。</li>
<li>跳转到项目中最近浏览的文件(c-p-e)。</li>
<li>在工作的项目间切换。</li>
<li>关闭项目有关的 buffer(c-p-k)。</li>
<li>在项目范围内替换(c-p-r)。</li>
<li>在项目所有 buffer 中查找出现(c-p-o)。</li>
<li>在项目中查找(c-p-s-g)。</li>
<li>重新生成你项目的 etags 或 gtags。</li>
<li>在 dired 中访问项目(c-p-D)。</li>
<li>在项目上执行 make。</li>
<li>在项目的根目录执行命令(c-p-!)。</li>
<li>检查脏的存储库。</li>
<li>创建项目设置文件(dir-local-file)(c-p-E)</li>
</ul>
</div>
</div>

<div id="outline-container-org8c90803" class="outline-2">
<h2 id="org8c90803"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4072c4e" class="outline-3">
<h3 id="org4072c4e"><span class="section-number-3">2.1</span> Prerequisites</h3>
</div>

<div id="outline-container-org5c7ec2b" class="outline-3">
<h3 id="org5c7ec2b"><span class="section-number-3">2.2</span> Installation via package.el</h3>
</div>

<div id="outline-container-orgd7c12f6" class="outline-3">
<h3 id="orgd7c12f6"><span class="section-number-3">2.3</span> Installation via use-package</h3>
<div class="outline-text-3" id="text-2-3">
<p>
如果要安装在主分支中找到的 Projectile 版本，请在 Emacs 初始化文件（.emacs 或 init.el）中声明以下内容：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">projectile</span>
  <span style="color: #d18aff;">:ensure</span> t
  <span style="color: #d18aff;">:config</span>
  (define-key projectile-mode-map (kbd <span style="color: #ff4ea3;">"s-p"</span>) 'projectile-command-map)
  (define-key projectile-mode-map (kbd <span style="color: #ff4ea3;">"C-c p"</span>) 'projectile-command-map)
  (projectile-mode +1))
</pre>
</div>
<p>
但是，如果您想要更加保守并且只使用 Projectile 的稳定版本，需要声明以下内容：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">projectile</span>
  <span style="color: #d18aff;">:ensure</span> t
  <span style="color: #d18aff;">:pin</span> melpa-stable
  <span style="color: #d18aff;">:config</span>
  (define-key projectile-mode-map (kbd <span style="color: #ff4ea3;">"s-p"</span>) 'projectile-command-map)
  (define-key projectile-mode-map (kbd <span style="color: #ff4ea3;">"C-c p"</span>) 'projectile-command-map)
  (projectile-mode +1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a0882d" class="outline-3">
<h3 id="org0a0882d"><span class="section-number-3">2.4</span> Installation via el-get</h3>
</div>

<div id="outline-container-org0922466" class="outline-3">
<h3 id="org0922466"><span class="section-number-3">2.5</span> Installation on Debian and Ubuntu</h3>
</div>

<div id="outline-container-orgf2e54e5" class="outline-3">
<h3 id="orgf2e54e5"><span class="section-number-3">2.6</span> Emacs Prelude</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Projectile 与 Emacs Prelude 捆绑在一起。如果是 Prelude 用户，Projectile 已经正确配置。
</p>
</div>
</div>
</div>

<div id="outline-container-org7c1acd2" class="outline-2">
<h2 id="org7c1acd2"><span class="section-number-2">3</span> Usage</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga6ab45f" class="outline-3">
<h3 id="orga6ab45f"><span class="section-number-3">3.1</span> Basic Usage</h3>
</div>

<div id="outline-container-org1894a3e" class="outline-3">
<h3 id="org1894a3e"><span class="section-number-3">3.2</span> Interactive Commands</h3>
</div>
</div>

<div id="outline-container-org9492ddf" class="outline-2">
<h2 id="org9492ddf"><span class="section-number-2">4</span> Projects</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org363d59b" class="outline-3">
<h3 id="org363d59b"><span class="section-number-3">4.1</span> Supported Project Types</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Projectile 的主要目标之一是在不需要任何配置的情况下操作各种项目类型。为实现这一点，它包含许多项目检测逻辑和项目类型特定的逻辑。
</p>
</div>
</div>

<div id="outline-container-orgceddc3e" class="outline-3">
<h3 id="orgceddc3e"><span class="section-number-3">4.2</span> Version Control Systems</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Projectile 可讲大多数版本控制的仓库识别为一个项目。Projectile 支持：
</p>
<ul class="org-ul">
<li>Git</li>
<li>Mercurial</li>
<li>Bazaar</li>
<li>Subversion</li>
<li>CVS</li>
<li>Fossil</li>
<li>Darcs</li>
</ul>
</div>
</div>
