content/emacs/modes/projectile-mode.org
** File markers
   Projectile 将许多文件识别为表示项目的 root。通常这些文件是各种构建工具的配置文件。支持以下内容：

   | File	         | Project Type                                       |
   |------------------+----------------------------------------------------|
   | rebar.config     | 	Rebar project file                             |
   | project.clj      | 	Leiningen project file                         |
   | build.boot	   | Boot-clj project file                              |
   | deps.edn	     | Clojure CLI project file                           |
   | SConstruct	   | Scons project file                                 |
   | pom.xml	      | Maven project file                                 |
   | build.sbt	    | SBT project file                                   |
   | gradlew	      | Gradle wrapper script                              |
   | build.gradle     | 	Gradle project file                            |
   | .ensime	      | Ensime configuration file                          |
   | Gemfile	      | Bundler file                                       |
   | requirements.txt | 	Pip file                                       |
   | setup.py	     | Setuptools file                                    |
   | tox.ini	      | Tox file                                           |
   | composer.json    | 	Composer project file                          |
   | Cargo.toml	   | Cargo project file                                 |
   | mix.exs	      | Elixir mix project file                            |
   | stack.yaml	   | Haskell's stack tool based project                 |
   | info.rkt	     | Racket package description file                    |
   | DESCRIPTION      | 	R package description file                     |
   | TAGS             | 	etags/ctags are usually in the root of project |
   | GTAGS	        | GNU Global tags                                    |
   | configure.in     | 	autoconf old style                             |
   | configure.ac     | 	autoconf new style                             |
   | cscope.out	   | cscope                                             |
   | Makefile	     | Make                                               |

   Projectile 自己的 =.projectile= 既可以作为项目标记，也可以作为配置文件。将在本节后面详细讨论。

** Adding Custom Project Types

   如果没有正确识别正在处理的项目，或者想定制项目类型，则可以在 Emacs 初始化代码中添加以下内容：
   #+BEGIN_SRC elisp
(projectile-register-project-type 'npm '("package.json")
                  :compile "npm install"
                  :test "npm test"
                  :run "npm start"
                  :test-suffix ".spec")

   #+END_SRC

   | Option           | 	Documentation                                                                               |
   |------------------+-------------------------------------------------------------------------------------------------|
   | :compilation-dir | 	A path, relative to the project root, from where to run the tests and compilation commands. |
   | :compile	     | A command to compile the project.                                                               |
   | :configure	   | A command to configure the project. %s will be substituted with the project root.               |
   | :run	         | A command to run the project.                                                                   |
   | :src-dir	     | A path, relative to the project root, where the source code lives.                              |
   | :test	        | A command to test the project.                                                                  |
   | :test-dir        | 	A path, relative to the project root, where the test code lives.                            |
   | :test-prefix     | 	A prefix to generate test files names.                                                      |
   | :test-suffix     | 	A suffix to generate test files names.                                                      |

** Returning Projectile Commands from a function
   如果要动态定义编译命令，可以在项目类型定义中传递函数的符号引用：
   #+BEGIN_SRC elisp
(defun my/compile-command ()
  "Returns a String representing the compile command to run for the given context"
  (cond
   ((and (eq major-mode 'java-mode)
         (not (string-match-p (regexp-quote "\\.*/test/\\.*") (buffer-file-name (current-buffer)))))
    "./gradlew build")
   ((eq major-mode 'web-mode)
    "./gradlew compile-templates")
   ))

(defun my/test-command ()
  "Returns a String representing the test command to run for the given context"
  (cond
   ((eq major-mode 'js-mode) "grunt test") ;; Test the JS of the project
   ((eq major-mode 'java-mode) "./gradlew test") ;; Test the Java code of the project
   ((eq major-mode 'my-mode) "special-command.sh") ;; Even Special conditions/test-sets can be covered
   ))

(projectile-register-project-type 'has-command-at-point '("file.txt")
                                  :compile 'my/compile-command
                                  :test 'my/test-command)
   #+END_SRC

   如果现在导航到 =./tests/= 目录下具有 =*.java= 扩展名的文件，并点击 =C-c c p= ，将看到 =./gradlew build= 作为建议。 如果要导航到 HTML 文件，编译命令将切换到 =./gradlew compile-templates= 。

   可同样设置的还有：
   + =:configure=
   + =:compile=
   + =:compilation-dir=
   + =:run=

   请注意，函数必须返回一个字符串才能正常工作。

** Customizing project root files
   可以设置 =projectile-project-root-files, projectile-project-root-files-top-down-recurring, projectile-project-root-files-bottom-up and projectile-project-root-files-functions= 的值来定制如何识别项目的 root。

** Ignoring files
   注意：使用 alien 方法索引项目时，忽略.projectile 的内容。

   如果想 Projectile 在索引项目时忽略某些文件，可以在 =.projectile= 文件中添加要忽略的路径，其中所有相对于根目录的路径都以 =/= 开头。忽略的项目都应该以 =-= 符号开头。 或者，没有任何前缀也意味着忽略后面的目录或文件模式。 以下是典型 Rails 应用程序的示例：
   #+BEGIN_EXAMPLE
-/log
-/tmp
-/vendor
-/public/uploads
   #+END_EXAMPLE

   这将忽略仅在项目根目录下的文件夹。Projectile 还支持相对路径名忽略：
   #+BEGIN_EXAMPLE
-tmp
-*.rb
-*.yml
-models
   #+END_EXAMPLE

   也可以忽略除某些子目录之外的所有内容。 这在选择要保留的目录比选择要忽略的目录更容易时很有用，尽管您可以同时执行这两个操作。 选择要保留的目录，这意味着其他所有内容都将被忽略。
   #+BEGIN_EXAMPLE
+/src/foo
+/tests/foo
   #+END_EXAMPLE
   注意：此时只能包含子目录，而不能包含文件模式。

   如果目录同时被指定为保留和忽略，则首先应用要保留，从而限制考虑的文件。然后将要忽略的路径和模式应用于该集合。

   最后，可以覆盖被忽略的文件。当 VCS 忽略的某些文件应被视为项目的一部分时，这尤其有用：
   #+BEGIN_EXAMPLE
!/src/foo
!*.yml
   #+END_EXAMPLE

