emacs/modes/projectile-mode.html

<div id="outline-container-org0db06a7" class="outline-3">
<h3 id="org0db06a7"><span class="section-number-3">4.3</span> File markers</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Projectile 将许多文件识别为表示项目的 root。通常这些文件是各种构建工具的配置文件。支持以下内容：
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-left">Project Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">rebar.config</td>
<td class="org-left">Rebar project file</td>
</tr>

<tr>
<td class="org-left">project.clj</td>
<td class="org-left">Leiningen project file</td>
</tr>

<tr>
<td class="org-left">build.boot</td>
<td class="org-left">Boot-clj project file</td>
</tr>

<tr>
<td class="org-left">deps.edn</td>
<td class="org-left">Clojure CLI project file</td>
</tr>

<tr>
<td class="org-left">SConstruct</td>
<td class="org-left">Scons project file</td>
</tr>

<tr>
<td class="org-left">pom.xml</td>
<td class="org-left">Maven project file</td>
</tr>

<tr>
<td class="org-left">build.sbt</td>
<td class="org-left">SBT project file</td>
</tr>

<tr>
<td class="org-left">gradlew</td>
<td class="org-left">Gradle wrapper script</td>
</tr>

<tr>
<td class="org-left">build.gradle</td>
<td class="org-left">Gradle project file</td>
</tr>

<tr>
<td class="org-left">.ensime</td>
<td class="org-left">Ensime configuration file</td>
</tr>

<tr>
<td class="org-left">Gemfile</td>
<td class="org-left">Bundler file</td>
</tr>

<tr>
<td class="org-left">requirements.txt</td>
<td class="org-left">Pip file</td>
</tr>

<tr>
<td class="org-left">setup.py</td>
<td class="org-left">Setuptools file</td>
</tr>

<tr>
<td class="org-left">tox.ini</td>
<td class="org-left">Tox file</td>
</tr>

<tr>
<td class="org-left">composer.json</td>
<td class="org-left">Composer project file</td>
</tr>

<tr>
<td class="org-left">Cargo.toml</td>
<td class="org-left">Cargo project file</td>
</tr>

<tr>
<td class="org-left">mix.exs</td>
<td class="org-left">Elixir mix project file</td>
</tr>

<tr>
<td class="org-left">stack.yaml</td>
<td class="org-left">Haskell's stack tool based project</td>
</tr>

<tr>
<td class="org-left">info.rkt</td>
<td class="org-left">Racket package description file</td>
</tr>

<tr>
<td class="org-left">DESCRIPTION</td>
<td class="org-left">R package description file</td>
</tr>

<tr>
<td class="org-left">TAGS</td>
<td class="org-left">etags/ctags are usually in the root of project</td>
</tr>

<tr>
<td class="org-left">GTAGS</td>
<td class="org-left">GNU Global tags</td>
</tr>

<tr>
<td class="org-left">configure.in</td>
<td class="org-left">autoconf old style</td>
</tr>

<tr>
<td class="org-left">configure.ac</td>
<td class="org-left">autoconf new style</td>
</tr>

<tr>
<td class="org-left">cscope.out</td>
<td class="org-left">cscope</td>
</tr>

<tr>
<td class="org-left">Makefile</td>
<td class="org-left">Make</td>
</tr>
</tbody>
</table>

<p>
Projectile 自己的 <code>.projectile</code> 既可以作为项目标记，也可以作为配置文件。将在本节后面详细讨论。
</p>
</div>
</div>

<div id="outline-container-org85f0f5d" class="outline-3">
<h3 id="org85f0f5d"><span class="section-number-3">4.4</span> Adding Custom Project Types</h3>
<div class="outline-text-3" id="text-4-4">
<p>
如果没有正确识别正在处理的项目，或者想定制项目类型，则可以在 Emacs 初始化代码中添加以下内容：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(projectile-register-project-type 'npm '(<span style="color: #ff4ea3;">"package.json"</span>)
                  <span style="color: #d18aff;">:compile</span> <span style="color: #ff4ea3;">"npm install"</span>
                  <span style="color: #d18aff;">:test</span> <span style="color: #ff4ea3;">"npm test"</span>
                  <span style="color: #d18aff;">:run</span> <span style="color: #ff4ea3;">"npm start"</span>
                  <span style="color: #d18aff;">:test-suffix</span> <span style="color: #ff4ea3;">".spec"</span>)

</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Documentation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">:compilation-dir</td>
<td class="org-left">A path, relative to the project root, from where to run the tests and compilation commands.</td>
</tr>

<tr>
<td class="org-left">:compile</td>
<td class="org-left">A command to compile the project.</td>
</tr>

<tr>
<td class="org-left">:configure</td>
<td class="org-left">A command to configure the project. %s will be substituted with the project root.</td>
</tr>

<tr>
<td class="org-left">:run</td>
<td class="org-left">A command to run the project.</td>
</tr>

<tr>
<td class="org-left">:src-dir</td>
<td class="org-left">A path, relative to the project root, where the source code lives.</td>
</tr>

<tr>
<td class="org-left">:test</td>
<td class="org-left">A command to test the project.</td>
</tr>

<tr>
<td class="org-left">:test-dir</td>
<td class="org-left">A path, relative to the project root, where the test code lives.</td>
</tr>

<tr>
<td class="org-left">:test-prefix</td>
<td class="org-left">A prefix to generate test files names.</td>
</tr>

<tr>
<td class="org-left">:test-suffix</td>
<td class="org-left">A suffix to generate test files names.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org63ce0ac" class="outline-3">
<h3 id="org63ce0ac"><span class="section-number-3">4.5</span> Returning Projectile Commands from a function</h3>
<div class="outline-text-3" id="text-4-5">
<p>
如果要动态定义编译命令，可以在项目类型定义中传递函数的符号引用：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">my/compile-command</span> ()
  <span style="color: #ff4b4b;">"Returns a String representing the compile command to run for the given context"</span>
  (<span style="color: #a1db00;">cond</span>
   ((<span style="color: #a1db00;">and</span> (eq major-mode 'java-mode)
         (not (string-match-p (regexp-quote <span style="color: #ff4ea3;">"\\.*/test/\\.*"</span>) (buffer-file-name (current-buffer)))))
    <span style="color: #ff4ea3;">"./gradlew build"</span>)
   ((eq major-mode 'web-mode)
    <span style="color: #ff4ea3;">"./gradlew compile-templates"</span>)
   ))

(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">my/test-command</span> ()
  <span style="color: #ff4b4b;">"Returns a String representing the test command to run for the given context"</span>
  (<span style="color: #a1db00;">cond</span>
   ((eq major-mode 'js-mode) <span style="color: #ff4ea3;">"grunt test"</span>) <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Test the JS of the project</span>
   ((eq major-mode 'java-mode) <span style="color: #ff4ea3;">"./gradlew test"</span>) <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Test the Java code of the project</span>
   ((eq major-mode 'my-mode) <span style="color: #ff4ea3;">"special-command.sh"</span>) <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Even Special conditions/test-sets can be covered</span>
   ))

(projectile-register-project-type 'has-command-at-point '(<span style="color: #ff4ea3;">"file.txt"</span>)
                                  <span style="color: #d18aff;">:compile</span> 'my/compile-command
                                  <span style="color: #d18aff;">:test</span> 'my/test-command)
</pre>
</div>

<p>
如果现在导航到 <code>./tests/</code> 目录下具有 <code>*.java</code> 扩展名的文件，并点击 <code>C-c c p</code> ，将看到 <code>./gradlew build</code> 作为建议。 如果要导航到 HTML 文件，编译命令将切换到 <code>./gradlew compile-templates</code> 。
</p>

<p>
可同样设置的还有：
</p>
<ul class="org-ul">
<li><code>:configure</code></li>
<li><code>:compile</code></li>
<li><code>:compilation-dir</code></li>
<li><code>:run</code></li>
</ul>

<p>
请注意，函数必须返回一个字符串才能正常工作。
</p>
</div>
</div>

<div id="outline-container-orgdf6f60e" class="outline-3">
<h3 id="orgdf6f60e"><span class="section-number-3">4.6</span> Customizing project root files</h3>
<div class="outline-text-3" id="text-4-6">
<p>
可以设置 <code>projectile-project-root-files, projectile-project-root-files-top-down-recurring, projectile-project-root-files-bottom-up and projectile-project-root-files-functions</code> 的值来定制如何识别项目的 root。
</p>
</div>
</div>

<div id="outline-container-org0c8616b" class="outline-3">
<h3 id="org0c8616b"><span class="section-number-3">4.7</span> Ignoring files</h3>
<div class="outline-text-3" id="text-4-7">
<p>
注意：使用 alien 方法索引项目时，忽略.projectile 的内容。
</p>

<p>
如果想 Projectile 在索引项目时忽略某些文件，可以在 <code>.projectile</code> 文件中添加要忽略的路径，其中所有相对于根目录的路径都以 <code>/</code> 开头。忽略的项目都应该以 <code>-</code> 符号开头。 或者，没有任何前缀也意味着忽略后面的目录或文件模式。 以下是典型 Rails 应用程序的示例：
</p>
<pre class="example">
-/log
-/tmp
-/vendor
-/public/uploads
</pre>

<p>
这将忽略仅在项目根目录下的文件夹。Projectile 还支持相对路径名忽略：
</p>
<pre class="example">
-tmp
-*.rb
-*.yml
-models
</pre>

<p>
也可以忽略除某些子目录之外的所有内容。 这在选择要保留的目录比选择要忽略的目录更容易时很有用，尽管您可以同时执行这两个操作。 选择要保留的目录，这意味着其他所有内容都将被忽略。
</p>
<pre class="example">
+/src/foo
+/tests/foo
</pre>
<p>
注意：此时只能包含子目录，而不能包含文件模式。
</p>

<p>
如果目录同时被指定为保留和忽略，则首先应用要保留，从而限制考虑的文件。然后将要忽略的路径和模式应用于该集合。
</p>

<p>
最后，可以覆盖被忽略的文件。当 VCS 忽略的某些文件应被视为项目的一部分时，这尤其有用：
</p>
<pre class="example">
!/src/foo
!*.yml
</pre>
</div>
</div>
