content/emacs/modes/projectile-mode.org
** File-local project root definitions
   如果要用指定文件覆盖 projectile 项目的 root，可以设置文件局部变量 projectile-project-root。 如果一个项目中的文件与另一个项目相关（例如，一个 git 仓库中的 Org 文件与其他项目相对应），这将非常有用。

** Storing project settings
   即使相同的语言项目也有可能各不相同：编码样式、自动完成源等。如果需要根据所选项目设置一些变量，可以使用名为 [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Directory-Variables.html][Per-directory Local]] 的 Emacs 标准功能。要使用它，您必须在项目目录中创建名为 =.dir-locals.el=  的文件（由常量 =dir-locals-file= 指定）。 此文件包含内容与以下类似：

   #+BEGIN_SRC elisp
((nil . ((secret-ftp-password . "secret")
         (compile-command . "make target-x")
         (eval . (progn
                   (defun my-project-specific-function ()
                     ;; ...
                     )))))
 (c-mode . ((c-file-style . "BSD"))))
   #+END_SRC

   使用键 nil 引用的顶级 alist 成员适用于整个项目。 名为 eval 的键将会求值。在上面的示例中，它用于创建函数。 它也可以用于将这样的函数添加到键映射中。

   还可以使用 =s-p E（M-x projectile-edit-dir-locals RET）= 快速访问或创建 =dir-locals-file= 。

   以下是如何在 Projectile 中使用此功能的几个示例。

*** Configuring Projectile's Behavior
    Projectile 有许多变量（通过 defcustom），允许用户自定义其行为。目录变量可用来基于每个项目设置这些自定义。

    可以通过以下方式为项目启用缓存：

    #+BEGIN_SRC elisp
((nil . ((projectile-enable-caching . t))))
    #+END_SRC

    如果某个项目有一个希望 Projectile 忽略的文件，可以通过以下方式自定义 Projectile：
    #+BEGIN_SRC elisp
((nil . ((projectile-globally-ignored-files . ("MyBinaryFile")))))
    #+END_SRC

    如果想包装 Projectile 用于列出存储库中文件的 git 命令，可以这样做
    #+BEGIN_SRC elisp
((nil . ((projectile-git-command . "/path/to/other/git ls-files -zco --exclude-standard"))))
    #+END_SRC

    如果要使用不同于 Projectile 命名项目的名称，可以使用以下内容对其进行自定义：
    #+BEGIN_SRC elisp
((nil . ((projectile-project-name . "your-project-name-here"))))
    #+END_SRC

*** Configure a Project's Compilation, Test and Run commands
    通过 =.dir-locals.el= 自定义命令：
    + for compilation - projectile-project-compilation-cmd
    + for testing - projectile-project-test-cmd
    + for running - projectile-project-run-cmd

    当这些变量的默认值为 nil 时，Projectile 将运行当前项目类型的默认命令。可以通过将它们设置为运行外部命令的字符串或 Emacs Lisp 函数来覆盖此行为：
    #+BEGIN_SRC elisp
(setq projectile-test-cmd #'custom-test-function)
    #+END_SRC

* Configuration
  Projectile 非常易于配置。几乎可以调整或扩展其行为的每个方面。

  在本节中，将介绍一些可能需要微调的常用配置，以使 Projectile 更好地适应工作流程。

** Project indexing method
   Projectile 有三种操作模式 - 一种是可移植的，使用 Emacs Lisp 实现（因此它是 Emacs 原生，被称为 native 索引方法），另外两种（hybrid 和 alien）依赖于外部命令，如 find，git 等 获取项目中的文件列表。

   alien 索引方法优化了 hybrid 索引方法的速度。 这意味着 Projectile 不会对外部命令返回的文件进行任何处理，将获得最大的性能。这种行为适用于大多数人，因为他们通常会在他们的 VCS 配置中放弃忽略（例如.gitignore），并且不会关心 Projectile 可能提供的任何其他 ignores/unignores/sorting。

   默认情况下，alien 方法用于除 Windows 之外的所有操作系统。Projectile 2.0 之前 hybrid 曾经是默认设置。

   要在所有操作系统中强制使用 native 索引：
   #+BEGIN_SRC elisp
(setq projectile-indexing-method 'native)
   #+END_SRC

   强制在所有操作系统中使用 hybrid 索引：
   #+BEGIN_SRC elisp
(setq projectile-indexing-method 'hybrid)
   #+END_SRC

   强制在所有操作系统中使用 alien 索引：
   #+BEGIN_SRC elisp
(setq projectile-indexing-method 'alien)
   #+END_SRC

    Windows 中这可以显著加速 Projectile（特别是在大型项目中）。 这种方法的缺点是它在 Windows 系统上得不到很好的支持，因为它需要在那里设置一些 Unix 实用程序。 如果出现问题，可以使用 native 索引模式。

** Alien indexing
   alien 索引以一种非常简单的方式工作 - 它只是执行一个返回项目中文件列表的命令。 对于版本控制的项目，默认情况下，Projectile 将使用 VCS 本身来获取文件列表。例如，Projectile 用于 Git 项目的命令：
   #+BEGIN_SRC sh
git ls-files -zco --exclude-standard
   #+END_SRC

   对于支持的 VCS，都有一个匹配的 Projectile 命令调用它（例如 projectile-git-command，projectile-hg-command 等）。

   警告：如果决定调整这些命令，请记住命令应该总是返回相对于项目根目录的文件列表，结果文件列表应该是 0 分隔（而不是换行符分隔）。

   对于非版本控制的项目，Projectile 将调用 projectile-generic-command 中的命令。默认情况下是：
   #+BEGIN_SRC sh
find . -type f -print0
   #+END_SRC

   安装 [[https://github.com/sharkdp/fd][fd]] 并用其替代 =git ls-files= （fd 理解 =.gitignore= ）和 =find= 是个好主意。

** Caching

*** Project files
    由于索引一个大项目并不是很快（特别使用 Emacs Lisp），Projectile 支持缓存项目的文件。默认情况下，启用 native 索引就会启用缓存。

    使用以下代码段无条件启用缓存：
    #+BEGIN_SRC elisp
(setq projectile-enable-caching t)
    #+END_SRC

    此时，可以尝试使用诸如 =s-p f (M-x projectile-find-file RET)= 之类的 Projectile 命令。

    在提示跳转到文件之前，运行 =C-u s-p f= 将使缓存无效。

    按 =s-p z= 会将当前访问的文件添加到当前项目的缓存中。 通常，在 Emacs 外部创建的文件将在第一次打开时自动添加到缓存中。

    项目缓存是持久的，将在 Emacs 重新启动期间保留。

    可以使用 =M-x projectile-purge-file-from-cache= 从缓存中清除单个文件, =M-x projectile-purge-dir-from-cache= 的从缓存中清除整个目录。

*** File exists cache
    Projectile 执行许多文件存在性检查，以识别项目根目录。通常情况下这很好，但在某些情况下，文件系统速度比平常慢得多，这可能导致在打开文件和浏览目录时 Emacs “冻结” 很长一段时间。

    最常见的情形是使用 =TRAMP/ssh= 连接远程系统。默认情况下，缓存所有远程文件的存在性检查。

    不缓存远程文件存在性检查：

    #+BEGIN_SRC elisp
(setq projectile-file-exists-remote-cache-expire nil)
    #+END_SRC

    设置远程文件存在检查缓存 10 分钟后过期：
    #+BEGIN_SRC elisp
(setq projectile-file-exists-remote-cache-expire (* 10 60))
    #+END_SRC

    还可以为本地文件系统启用缓存，但通常没必要：
    #+BEGIN_SRC elisp
(setq projectile-file-exists-local-cache-expire (* 5 60))
    #+END_SRC

** Using Projectile everywhere
   如果希望在每个目录中都使用 Projectile（即使没有项目文件）：
   #+BEGIN_SRC elisp
   (setq projectile-require-project-root nil)
   #+END_SRC

** Switching projects
   当运行 projectile-switch-project（s-p p）时，Projectile 会调用 projectile-switch-project-action 中指定的命令（默认情况下它是 projectile-find-file）。

   使用前缀参数（C-u s-p p）调用命令将触发 Projectile Commander，可以快速访问可能要在项目上调用的大多数常用命令。

   根据您的个人工作流程和习惯，可能需要改变 =projectile-switch-project-action= 的值：

*** projectile-find-file

    默认值。使用此设置，一旦通过 Projectile 的补全系统选择了项目（见下文），将在补全系统中继续选择要访问的文件。projectile-find-file 能够检索项目根目录下的所有子项目中的文件，例如 Git 子模块。目前仅支持 Git。将来会增加对其他 VCS 的支持。

*** projectile-find-file-in-known-projects
    与 projectile-find-file 类似，但列出了所有已知项目中的所有文件。由于文件总数可能很大，启用缓存有助于后续使用。

