emacs/modes/projectile-mode.html

<div id="outline-container-org8a57771" class="outline-3">
<h3 id="org8a57771"><span class="section-number-3">4.8</span> File-local project root definitions</h3>
<div class="outline-text-3" id="text-4-8">
<p>
如果要用指定文件覆盖 projectile 项目的 root，可以设置文件局部变量 projectile-project-root。 如果一个项目中的文件与另一个项目相关（例如，一个 git 仓库中的 Org 文件与其他项目相对应），这将非常有用。
</p>
</div>
</div>

<div id="outline-container-orge0742c4" class="outline-3">
<h3 id="orge0742c4"><span class="section-number-3">4.9</span> Storing project settings</h3>
<div class="outline-text-3" id="text-4-9">
<p>
即使相同的语言项目也有可能各不相同：编码样式、自动完成源等。如果需要根据所选项目设置一些变量，可以使用名为 <a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Directory-Variables.html">Per-directory Local</a> 的 Emacs 标准功能。要使用它，您必须在项目目录中创建名为 <code>.dir-locals.el</code>  的文件（由常量 <code>dir-locals-file</code> 指定）。 此文件包含内容与以下类似：
</p>

<div class="org-src-container">
<pre class="src src-elisp">((nil . ((secret-ftp-password . <span style="color: #ff4ea3;">"secret"</span>)
         (compile-command . <span style="color: #ff4ea3;">"make target-x"</span>)
         (eval . (<span style="color: #a1db00;">progn</span>
                   (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">my-project-specific-function</span> ()
                     <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">...</span>
                     )))))
 (c-mode . ((c-file-style . <span style="color: #ff4ea3;">"BSD"</span>))))
</pre>
</div>

<p>
使用键 nil 引用的顶级 alist 成员适用于整个项目。 名为 eval 的键将会求值。在上面的示例中，它用于创建函数。 它也可以用于将这样的函数添加到键映射中。
</p>

<p>
还可以使用 <code>s-p E（M-x projectile-edit-dir-locals RET）</code> 快速访问或创建 <code>dir-locals-file</code> 。
</p>

<p>
以下是如何在 Projectile 中使用此功能的几个示例。
</p>
</div>

<div id="outline-container-org892a399" class="outline-4">
<h4 id="org892a399"><span class="section-number-4">4.9.1</span> Configuring Projectile's Behavior</h4>
<div class="outline-text-4" id="text-4-9-1">
<p>
Projectile 有许多变量（通过 defcustom），允许用户自定义其行为。目录变量可用来基于每个项目设置这些自定义。
</p>

<p>
可以通过以下方式为项目启用缓存：
</p>

<div class="org-src-container">
<pre class="src src-elisp">((nil . ((projectile-enable-caching . t))))
</pre>
</div>

<p>
如果某个项目有一个希望 Projectile 忽略的文件，可以通过以下方式自定义 Projectile：
</p>
<div class="org-src-container">
<pre class="src src-elisp">((nil . ((projectile-globally-ignored-files . (<span style="color: #ff4ea3;">"MyBinaryFile"</span>)))))
</pre>
</div>

<p>
如果想包装 Projectile 用于列出存储库中文件的 git 命令，可以这样做
</p>
<div class="org-src-container">
<pre class="src src-elisp">((nil . ((projectile-git-command . <span style="color: #ff4ea3;">"/path/to/other/git ls-files -zco --exclude-standard"</span>))))
</pre>
</div>

<p>
如果要使用不同于 Projectile 命名项目的名称，可以使用以下内容对其进行自定义：
</p>
<div class="org-src-container">
<pre class="src src-elisp">((nil . ((projectile-project-name . <span style="color: #ff4ea3;">"your-project-name-here"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e52b37" class="outline-4">
<h4 id="org1e52b37"><span class="section-number-4">4.9.2</span> Configure a Project's Compilation, Test and Run commands</h4>
<div class="outline-text-4" id="text-4-9-2">
<p>
通过 <code>.dir-locals.el</code> 自定义命令：
</p>
<ul class="org-ul">
<li>for compilation - projectile-project-compilation-cmd</li>
<li>for testing - projectile-project-test-cmd</li>
<li>for running - projectile-project-run-cmd</li>
</ul>

<p>
当这些变量的默认值为 nil 时，Projectile 将运行当前项目类型的默认命令。可以通过将它们设置为运行外部命令的字符串或 Emacs Lisp 函数来覆盖此行为：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-test-cmd #'custom-test-function)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org9d6733c" class="outline-2">
<h2 id="org9d6733c"><span class="section-number-2">5</span> Configuration</h2>
<div class="outline-text-2" id="text-5">
<p>
Projectile 非常易于配置。几乎可以调整或扩展其行为的每个方面。
</p>

<p>
在本节中，将介绍一些可能需要微调的常用配置，以使 Projectile 更好地适应工作流程。
</p>
</div>

<div id="outline-container-org28c5b59" class="outline-3">
<h3 id="org28c5b59"><span class="section-number-3">5.1</span> Project indexing method</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Projectile 有三种操作模式 - 一种是可移植的，使用 Emacs Lisp 实现（因此它是 Emacs 原生，被称为 native 索引方法），另外两种（hybrid 和 alien）依赖于外部命令，如 find，git 等 获取项目中的文件列表。
</p>

<p>
alien 索引方法优化了 hybrid 索引方法的速度。 这意味着 Projectile 不会对外部命令返回的文件进行任何处理，将获得最大的性能。这种行为适用于大多数人，因为他们通常会在他们的 VCS 配置中放弃忽略（例如.gitignore），并且不会关心 Projectile 可能提供的任何其他 ignores/unignores/sorting。
</p>

<p>
默认情况下，alien 方法用于除 Windows 之外的所有操作系统。Projectile 2.0 之前 hybrid 曾经是默认设置。
</p>

<p>
要在所有操作系统中强制使用 native 索引：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-indexing-method 'native)
</pre>
</div>

<p>
强制在所有操作系统中使用 hybrid 索引：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-indexing-method 'hybrid)
</pre>
</div>

<p>
强制在所有操作系统中使用 alien 索引：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-indexing-method 'alien)
</pre>
</div>

<p>
Windows 中这可以显著加速 Projectile（特别是在大型项目中）。 这种方法的缺点是它在 Windows 系统上得不到很好的支持，因为它需要在那里设置一些 Unix 实用程序。 如果出现问题，可以使用 native 索引模式。
</p>
</div>
</div>

<div id="outline-container-org7f37073" class="outline-3">
<h3 id="org7f37073"><span class="section-number-3">5.2</span> Alien indexing</h3>
<div class="outline-text-3" id="text-5-2">
<p>
alien 索引以一种非常简单的方式工作 - 它只是执行一个返回项目中文件列表的命令。 对于版本控制的项目，默认情况下，Projectile 将使用 VCS 本身来获取文件列表。例如，Projectile 用于 Git 项目的命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">git ls-files -zco --exclude-standard
</pre>
</div>

<p>
对于支持的 VCS，都有一个匹配的 Projectile 命令调用它（例如 projectile-git-command，projectile-hg-command 等）。
</p>

<p>
警告：如果决定调整这些命令，请记住命令应该总是返回相对于项目根目录的文件列表，结果文件列表应该是 0 分隔（而不是换行符分隔）。
</p>

<p>
对于非版本控制的项目，Projectile 将调用 projectile-generic-command 中的命令。默认情况下是：
</p>
<div class="org-src-container">
<pre class="src src-sh">find . -type f -print0
</pre>
</div>

<p>
安装 <a href="https://github.com/sharkdp/fd">fd</a> 并用其替代 <code>git ls-files</code> （fd 理解 <code>.gitignore</code> ）和 <code>find</code> 是个好主意。
</p>
</div>
</div>

<div id="outline-container-orgfeb83f6" class="outline-3">
<h3 id="orgfeb83f6"><span class="section-number-3">5.3</span> Caching</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orgcbc27b1" class="outline-4">
<h4 id="orgcbc27b1"><span class="section-number-4">5.3.1</span> Project files</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
由于索引一个大项目并不是很快（特别使用 Emacs Lisp），Projectile 支持缓存项目的文件。默认情况下，启用 native 索引就会启用缓存。
</p>

<p>
使用以下代码段无条件启用缓存：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-enable-caching t)
</pre>
</div>

<p>
此时，可以尝试使用诸如 <code>s-p f (M-x projectile-find-file RET)</code> 之类的 Projectile 命令。
</p>

<p>
在提示跳转到文件之前，运行 <code>C-u s-p f</code> 将使缓存无效。
</p>

<p>
按 <code>s-p z</code> 会将当前访问的文件添加到当前项目的缓存中。 通常，在 Emacs 外部创建的文件将在第一次打开时自动添加到缓存中。
</p>

<p>
项目缓存是持久的，将在 Emacs 重新启动期间保留。
</p>

<p>
可以使用 <code>M-x projectile-purge-file-from-cache</code> 从缓存中清除单个文件, <code>M-x projectile-purge-dir-from-cache</code> 的从缓存中清除整个目录。
</p>
</div>
</div>

<div id="outline-container-org907932b" class="outline-4">
<h4 id="org907932b"><span class="section-number-4">5.3.2</span> File exists cache</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Projectile 执行许多文件存在性检查，以识别项目根目录。通常情况下这很好，但在某些情况下，文件系统速度比平常慢得多，这可能导致在打开文件和浏览目录时 Emacs “冻结” 很长一段时间。
</p>

<p>
最常见的情形是使用 <code>TRAMP/ssh</code> 连接远程系统。默认情况下，缓存所有远程文件的存在性检查。
</p>

<p>
不缓存远程文件存在性检查：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-file-exists-remote-cache-expire nil)
</pre>
</div>

<p>
设置远程文件存在检查缓存 10 分钟后过期：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-file-exists-remote-cache-expire (* 10 60))
</pre>
</div>

<p>
还可以为本地文件系统启用缓存，但通常没必要：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-file-exists-local-cache-expire (* 5 60))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org67c1a6e" class="outline-3">
<h3 id="org67c1a6e"><span class="section-number-3">5.4</span> Using Projectile everywhere</h3>
<div class="outline-text-3" id="text-5-4">
<p>
如果希望在每个目录中都使用 Projectile（即使没有项目文件）：
</p>
<div class="org-src-container">
<pre class="src src-elisp">   (<span style="color: #a1db00;">setq</span> projectile-require-project-root nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ea6c10" class="outline-3">
<h3 id="org7ea6c10"><span class="section-number-3">5.5</span> Switching projects</h3>
<div class="outline-text-3" id="text-5-5">
<p>
当运行 projectile-switch-project（s-p p）时，Projectile 会调用 projectile-switch-project-action 中指定的命令（默认情况下它是 projectile-find-file）。
</p>

<p>
使用前缀参数（C-u s-p p）调用命令将触发 Projectile Commander，可以快速访问可能要在项目上调用的大多数常用命令。
</p>

<p>
根据您的个人工作流程和习惯，可能需要改变 <code>projectile-switch-project-action</code> 的值：
</p>
</div>

<div id="outline-container-org46471a8" class="outline-4">
<h4 id="org46471a8"><span class="section-number-4">5.5.1</span> projectile-find-file</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
默认值。使用此设置，一旦通过 Projectile 的补全系统选择了项目（见下文），将在补全系统中继续选择要访问的文件。projectile-find-file 能够检索项目根目录下的所有子项目中的文件，例如 Git 子模块。目前仅支持 Git。将来会增加对其他 VCS 的支持。
</p>
</div>
</div>

<div id="outline-container-orgfc99241" class="outline-4">
<h4 id="orgfc99241"><span class="section-number-4">5.5.2</span> projectile-find-file-in-known-projects</h4>
<div class="outline-text-4" id="text-5-5-2">
<p>
与 projectile-find-file 类似，但列出了所有已知项目中的所有文件。由于文件总数可能很大，启用缓存有助于后续使用。
</p>
</div>
</div>
