content/emacs/modes/projectile-mode.org
*** projectile-find-file-dwim
    如果 point 在文件路径上，Projectile 首先尝试在项目中搜索该文件：
    + 如果它只找到一个文件，它会立即切换到该文件。即使文件名不完整，但当前项目中只有一个文件与 point 处的文件名匹配也会生效。例如，如果只有一个名为 =projectile/projectile.el= 的文件，但当前文件名是 =projectile/proj= （不完整），则 projectile-find-file 仍会立即切换到 =projectile/projectile.el= ，因为这是唯一匹配的文件名。

    + 如果找到文件列表，则会显示列表以供选择。当文件名在项目中出现多个文件名时，或者 point 上的文件名是项目中两个以上文件的前缀时，将显示文件列表。例如，如果在 =projectile/= 之类的文件路径上执行 projectile-find-file，它会列出该目录的内容。如果它在诸如 =projectile/a= 的部分文件名上执行，则会显示该目录中具有字符 =a= 的文件列表。

    + 如果找不到任何内容，则显示项目中所有文件的列表以供选择。

*** projectile-dired
    #+BEGIN_SRC elisp
(setq projectile-switch-project-action＃'projectile-dired)
    #+END_SRC

    使用此设置，选择项目后，项目的顶级目录将立即在 dired 缓冲区中打开。

*** projectile-find-dir
    #+BEGIN_SRC elisp
(setq projectile-switch-project-action＃'projectile-find-dir)
    #+END_SRC
    使用此设置，选择项目后，将保留在 Projectile 的补全系统中以选择项目的子目录，然后在 dired 缓冲区中打开该子目录。如果使用此设置，可能还需要设置以下代码允许选择顶级目录：

    #+BEGIN_SRC elisp
(setq projectile-find-dir-includes-top-level t)
    #+END_SRC

** Completion Options

*** Ido
    Projectile 默认使用 ido 作为其补全系统。ido 非常受欢迎，内置于 Emacs 中。

    如果要使用 ido 补全，强烈建议安装可选的 flx-ido 软件包，它为 ido 内置的 flex 匹配提供了更强大的替代方案。

*** Ivy (recommended)
    另外一个补全选项是[[https://github.com/abo-abo/swiper][ivy]]：
    #+BEGIN_SRC elisp
(setq projectile-completion-system 'ivy)
    #+END_SRC

*** Basic (Emacs's default)
    如果你不喜欢 ido 和常春藤你可以使用常规补全：
    #+BEGIN_SRC elisp
(setq projectile-completion-system 'default)
    #+END_SRC

*** Custom Completion Function
    还可以将 projectile-completion-system 设置为函数：
    #+BEGIN_SRC elisp
(setq projectile-completion-system #'my-custom-completion-fn)
(setq projectile-completion-system
      (lambda (prompt choices)
        ;; ...
        ))
    #+END_SRC
    自定义完成功能的一个[[https://gist.github.com/rejeep/5933343][示例]]，它仅显示文件名（不包括路径），如果选择的文件不唯一，则会显示另一个名称相对于项目根目录的补全。

*** Regenerate tags
    为了能够通过 projectile-tags-command 重新生成项目的标签，应该安装 [[http://ctags.sourceforge.net/][Exuberant Ctags]] 并将其添加到 PATH，而不是与 Emacs 发行版一起提供的普通 ctags。

    注意：Exuberant Ctags 已经停止开发，使用 [[https://github.com/universal-ctags/ctags][Universal-ctags]] 替代。

** Idle Timer
   每当 Emacs 在该项目中空闲 projectile-idle-timer-seconds 配置时间（默认为 30 秒），可以运行配置 projectile-idle-timer-hook。要启用此功能，请运行：

   #+BEGIN_SRC elisp
(add-hook 'projectile-idle-timer-hook #'my-projectile-idle-timer-function)
   #+END_SRC

** Mode line indicator
   默认情况下，Projectile 的 minor mode 指示器以 “Projectile [ProjectName：ProjectType]” 的形式出现。可以通过几个自定义变量进行配置：
   + =projectile-mode-line-prefix= （默认为 “Projectile”）控制 mode-line 的静态部分。
   + =projectile-dynamic-mode-line= （默认为 t）控制是否显示 mode-line 的项目名称和类型部分。
   + =projectile-mode-line-function= （默认为 projectile-default-mode-line）控制要生成 mode-line 的实际调用的函数。如果想显示不同的信息，应该提供一个自定义函数来替换默认值，例如：
     #+BEGIN_SRC elisp
(setq projectile-mode-line-function '(lambda () (format " Proj[%s]" (projectile-project-name))))
     #+END_SRC

   注意：编辑远程文件时（通过 TRAMP），项目名称和类型不会出现，因为重新计算项目名称是一个相当慢的操作，并且会减慢打开文件的速度。它们也不会出现在非文件缓冲区中，因为它们是通过 find-file-hook 更新的。

* Extensions
  有许多软件包构建在 Projectile 提供的基本功能之上：
  + [[https://github.com/ericdanan/counsel-projectile][counsel-projectile]] provides Ivy integration
  + [[https://github.com/bbatsov/helm-projectile][helm-projectile]] provides Helm integration
  + [[https://github.com/bbatsov/persp-projectile][persp-projectile]] provides perspective.el integration
  + [[https://github.com/asok/projectile-rails][projectile-rails]] provides extra functionality for Ruby on Rails projects
