emacs/modes/projectile-mode.html

<div id="outline-container-org72ee950" class="outline-4">
<h4 id="org72ee950"><span class="section-number-4">5.5.3</span> projectile-find-file-dwim</h4>
<div class="outline-text-4" id="text-5-5-3">
<p>
如果 point 在文件路径上，Projectile 首先尝试在项目中搜索该文件：
</p>
<ul class="org-ul">
<li>如果它只找到一个文件，它会立即切换到该文件。即使文件名不完整，但当前项目中只有一个文件与 point 处的文件名匹配也会生效。例如，如果只有一个名为 <code>projectile/projectile.el</code> 的文件，但当前文件名是 <code>projectile/proj</code> （不完整），则 projectile-find-file 仍会立即切换到 <code>projectile/projectile.el</code> ，因为这是唯一匹配的文件名。</li>

<li>如果找到文件列表，则会显示列表以供选择。当文件名在项目中出现多个文件名时，或者 point 上的文件名是项目中两个以上文件的前缀时，将显示文件列表。例如，如果在 <code>projectile/</code> 之类的文件路径上执行 projectile-find-file，它会列出该目录的内容。如果它在诸如 <code>projectile/a</code> 的部分文件名上执行，则会显示该目录中具有字符 <code>a</code> 的文件列表。</li>

<li>如果找不到任何内容，则显示项目中所有文件的列表以供选择。</li>
</ul>
</div>
</div>

<div id="outline-container-org4162725" class="outline-4">
<h4 id="org4162725"><span class="section-number-4">5.5.4</span> projectile-dired</h4>
<div class="outline-text-4" id="text-5-5-4">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-switch-project-action&#65283;'projectile-dired)
</pre>
</div>

<p>
使用此设置，选择项目后，项目的顶级目录将立即在 dired 缓冲区中打开。
</p>
</div>
</div>

<div id="outline-container-orgde43fdf" class="outline-4">
<h4 id="orgde43fdf"><span class="section-number-4">5.5.5</span> projectile-find-dir</h4>
<div class="outline-text-4" id="text-5-5-5">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-switch-project-action&#65283;'projectile-find-dir)
</pre>
</div>
<p>
使用此设置，选择项目后，将保留在 Projectile 的补全系统中以选择项目的子目录，然后在 dired 缓冲区中打开该子目录。如果使用此设置，可能还需要设置以下代码允许选择顶级目录：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-find-dir-includes-top-level t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0268351" class="outline-3">
<h3 id="org0268351"><span class="section-number-3">5.6</span> Completion Options</h3>
<div class="outline-text-3" id="text-5-6">
</div>
<div id="outline-container-orgd2b4eeb" class="outline-4">
<h4 id="orgd2b4eeb"><span class="section-number-4">5.6.1</span> Ido</h4>
<div class="outline-text-4" id="text-5-6-1">
<p>
Projectile 默认使用 ido 作为其补全系统。ido 非常受欢迎，内置于 Emacs 中。
</p>

<p>
如果要使用 ido 补全，强烈建议安装可选的 flx-ido 软件包，它为 ido 内置的 flex 匹配提供了更强大的替代方案。
</p>
</div>
</div>

<div id="outline-container-orgf2b337b" class="outline-4">
<h4 id="orgf2b337b"><span class="section-number-4">5.6.2</span> Ivy (recommended)</h4>
<div class="outline-text-4" id="text-5-6-2">
<p>
另外一个补全选项是<a href="https://github.com/abo-abo/swiper">ivy</a>：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-completion-system 'ivy)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3963fd8" class="outline-4">
<h4 id="org3963fd8"><span class="section-number-4">5.6.3</span> Basic (Emacs's default)</h4>
<div class="outline-text-4" id="text-5-6-3">
<p>
如果你不喜欢 ido 和常春藤你可以使用常规补全：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-completion-system 'default)
</pre>
</div>
</div>
</div>

<div id="outline-container-org869d776" class="outline-4">
<h4 id="org869d776"><span class="section-number-4">5.6.4</span> Custom Completion Function</h4>
<div class="outline-text-4" id="text-5-6-4">
<p>
还可以将 projectile-completion-system 设置为函数：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-completion-system #'my-custom-completion-fn)
(<span style="color: #a1db00;">setq</span> projectile-completion-system
      (<span style="color: #a1db00;">lambda</span> (prompt choices)
        <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">...</span>
        ))
</pre>
</div>
<p>
自定义完成功能的一个<a href="https://gist.github.com/rejeep/5933343">示例</a>，它仅显示文件名（不包括路径），如果选择的文件不唯一，则会显示另一个名称相对于项目根目录的补全。
</p>
</div>
</div>

<div id="outline-container-org4b38cdd" class="outline-4">
<h4 id="org4b38cdd"><span class="section-number-4">5.6.5</span> Regenerate tags</h4>
<div class="outline-text-4" id="text-5-6-5">
<p>
为了能够通过 projectile-tags-command 重新生成项目的标签，应该安装 <a href="http://ctags.sourceforge.net/">Exuberant Ctags</a> 并将其添加到 PATH，而不是与 Emacs 发行版一起提供的普通 ctags。
</p>

<p>
注意：Exuberant Ctags 已经停止开发，使用 <a href="https://github.com/universal-ctags/ctags">Universal-ctags</a> 替代。
</p>
</div>
</div>
</div>

<div id="outline-container-org0448c82" class="outline-3">
<h3 id="org0448c82"><span class="section-number-3">5.7</span> Idle Timer</h3>
<div class="outline-text-3" id="text-5-7">
<p>
每当 Emacs 在该项目中空闲 projectile-idle-timer-seconds 配置时间（默认为 30 秒），可以运行配置 projectile-idle-timer-hook。要启用此功能，请运行：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-hook 'projectile-idle-timer-hook #'my-projectile-idle-timer-function)
</pre>
</div>
</div>
</div>

<div id="outline-container-org42f9375" class="outline-3">
<h3 id="org42f9375"><span class="section-number-3">5.8</span> Mode line indicator</h3>
<div class="outline-text-3" id="text-5-8">
<p>
默认情况下，Projectile 的 minor mode 指示器以 “Projectile [ProjectName：ProjectType]” 的形式出现。可以通过几个自定义变量进行配置：
</p>
<ul class="org-ul">
<li><code>projectile-mode-line-prefix</code> （默认为 “Projectile”）控制 mode-line 的静态部分。</li>
<li><code>projectile-dynamic-mode-line</code> （默认为 t）控制是否显示 mode-line 的项目名称和类型部分。</li>
<li><p>
<code>projectile-mode-line-function</code> （默认为 projectile-default-mode-line）控制要生成 mode-line 的实际调用的函数。如果想显示不同的信息，应该提供一个自定义函数来替换默认值，例如：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> projectile-mode-line-function '(lambda () (format <span style="color: #ff4ea3;">" Proj[%s]"</span> (projectile-project-name))))
</pre>
</div></li>
</ul>

<p>
注意：编辑远程文件时（通过 TRAMP），项目名称和类型不会出现，因为重新计算项目名称是一个相当慢的操作，并且会减慢打开文件的速度。它们也不会出现在非文件缓冲区中，因为它们是通过 find-file-hook 更新的。
</p>
</div>
</div>
</div>

<div id="outline-container-orge208ec5" class="outline-2">
<h2 id="orge208ec5"><span class="section-number-2">6</span> Extensions</h2>
<div class="outline-text-2" id="text-6">
<p>
有许多软件包构建在 Projectile 提供的基本功能之上：
</p>
<ul class="org-ul">
<li><a href="https://github.com/ericdanan/counsel-projectile">counsel-projectile</a> provides Ivy integration</li>
<li><a href="https://github.com/bbatsov/helm-projectile">helm-projectile</a> provides Helm integration</li>
<li><a href="https://github.com/bbatsov/persp-projectile">persp-projectile</a> provides perspective.el integration</li>
<li><a href="https://github.com/asok/projectile-rails">projectile-rails</a> provides extra functionality for Ruby on Rails projects</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-05 四 17:01</p>
<p class="validation"></p>
</div>
</body>
</html>
